basic/controllers/SiteController.php

UPDATE `orders` SET `status`='Принят' WHERE `id`=3
---
    public function actionUpdateOrder($id)
    {
        $action = 'updateOrder';
        $model = $this->findOrderModel($id);

        if ($model->load(Yii::$app->request->post()) && $model->save()) {

SELECT * FROM `orders` WHERE `id`='3'
---
    protected function findOrderModel($id)
    {
        if (($model = Order::findOne($id)) !== null) {

SELECT * FROM `orders` WHERE `user_id`=1
---
    public function actionProfile()
    {
        // Получаем текущего авторизованного пользователя, если он есть
        $user = Yii::$app->user->identity;

        // Проверяем, авторизован ли пользователь
        if ($user !== null) {
            // Если пользователь авторизован, получаем его ID
            $userId = $user->id;

            // Получаем все заказы, сделанные текущим пользователем
            $orders = Order::find()->where(['user_id' => $userId])->all();