basic/models/Order.php

    public function applyPromocode($promocode)
    {
        $promoCodeModel = PromoCode::findOne(['code' => $promocode]);
---
SELECT * FROM `promo_code` WHERE `code`='kolt22'